In [3]:
import pandas as pd

df = pd.DataFrame([{'Name':'Azamat','Item':'Book','Cost':24.2},
                  {'Name':'Laziz','Item':'Pen','Cost':1},
                  {'Name': 'Shox','Item':'Pencil','Cost':2.5}],index=['Store1','Store2','Store3'])
df

        Cost    Item    Name
Store1  24.2    Book  Azamat
Store2   1.0     Pen   Laziz
Store3   2.5  Pencil    Shox

In [4]:
df['Date'] = ['January 1','December 12','December 19']

In [5]:
df

        Cost    Item    Name         Date
Store1  24.2    Book  Azamat    January 1
Store2   1.0     Pen   Laziz  December 12
Store3   2.5  Pencil    Shox  December 19

In [7]:
df['Delivered']=True

In [8]:
df

        Cost    Item    Name         Date  Delivered
Store1  24.2    Book  Azamat    January 1       True
Store2   1.0     Pen   Laziz  December 12       True
Store3   2.5  Pencil    Shox  December 19       True

In [9]:
df['Feedback'] = ['Positive',None,'Negative']

In [10]:
df

        Cost    Item    Name         Date  Delivered  Feedback
Store1  24.2    Book  Azamat    January 1       True  Positive
Store2   1.0     Pen   Laziz  December 12       True      None
Store3   2.5  Pencil    Shox  December 19       True  Negative

In [11]:
adf = df.reset_index()
adf

    index  Cost    Item    Name         Date  Delivered  Feedback
0  Store1  24.2    Book  Azamat    January 1       True  Positive
1  Store2   1.0     Pen   Laziz  December 12       True      None
2  Store3   2.5  Pencil    Shox  December 19       True  Negative

In [12]:
adf['Date'] = pd.Series({0: 'December 1',2: 'January 2'})

In [13]:
adf

    index  Cost    Item    Name        Date  Delivered  Feedback
0  Store1  24.2    Book  Azamat  December 1       True  Positive
1  Store2   1.0     Pen   Laziz         NaN       True      None
2  Store3   2.5  Pencil    Shox   January 2       True  Negative

In [14]:
staff_df = pd.DataFrame([{'Name':'John','Role':'Prof'},
                        {'Name':'Nate','Role':'Tutor Assistant'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name':'Jasur','School':'SOCIE'},
                        {'Name':'Nate','School':'SOL'}])
student_df = student_df.set_index('Name')

print(staff_df)
print()
print(student_df)

                 Role
Name
John             Prof
Nate  Tutor Assistant

      School
Name
Jasur  SOCIE
Nate     SOL

In [15]:
pd.merge(staff_df,student_df,how='outer', left_index=True, right_index=True)

                  Role School
Name
Jasur              NaN  SOCIE
John              Prof    NaN
Nate   Tutor Assistant    SOL

In [16]:
pd.merge(staff_df, student_df,how='inner',left_index=True,right_index=True)

                 Role School
Name
Nate  Tutor Assistant    SOL

In [17]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role School
Name
John             Prof    NaN
Nate  Tutor Assistant    SOL

In [18]:
pd.merge(student_df,staff_df, how='left',left_index=True,right_index=True)

      School             Role
Name
Jasur  SOCIE              NaN
Nate     SOL  Tutor Assistant

In [19]:
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                  Role School
Name
Jasur              NaN  SOCIE
Nate   Tutor Assistant    SOL

# Groupby

In [20]:
df = pd.DataFrame({'Animal' : ['Falcon', 'Falcon',
                               'Parrot', 'Parrot'],
                    'Max Speed' : [380., 370., 24., 26.],
                  'Age':[9,10,2,5]})
df

   Age  Animal  Max Speed
0    9  Falcon      380.0
1   10  Falcon      370.0
2    2  Parrot       24.0
3    5  Parrot       26.0

In [21]:
df.groupby(['Animal']).mean()

        Age  Max Speed
Animal
Falcon  9.5      375.0
Parrot  3.5       25.0

In [25]:
import numpy as np
df = pd.read_csv('../census.csv')
for group, frame in df.groupby('STNAME'):
    avg = np.average(frame['CENSUS2010POP'])
    print('Countries in state '+group+ 'have avg pop of of '+ str(avg))

Countries in state Alabamahave avg pop of of 140580.470588
Countries in state Alaskahave avg pop of of 47348.7333333
Countries in state Arizonahave avg pop of of 799002.125
Countries in state Arkansashave avg pop of of 76734.6842105
Countries in state Californiahave avg pop of of 1262845.9661
Countries in state Coloradohave avg pop of of 154744.492308
Countries in state Connecticuthave avg pop of of 794243.777778
Countries in state Delawarehave avg pop of of 448967.0
Countries in state District of Columbiahave avg pop of of 601723.0
Countries in state Floridahave avg pop of of 552979.705882
Countries in state Georgiahave avg pop of of 121095.6625
Countries in state Hawaiihave avg pop of of 453433.666667
Countries in state Idahohave avg pop of of 69670.3111111
Countries in state Illinoishave avg pop of of 249138.485437
Countries in state Indianahave avg pop of of 139436.602151
Countries in state Iowahave avg pop of of 60927.1
Countries in state Kansashave avg pop of of 53832.4150943
Countries in state Kentuckyhave avg pop of of 71725.0743802
Countries in state Louisianahave avg pop of of 139488.369231
Countries in state Mainehave avg pop of of 156277.764706
Countries in state Marylandhave avg pop of of 461884.16
Countries in state Massachusettshave avg pop of of 873017.2
Countries in state Michiganhave avg pop of of 235324.761905
Countries in state Minnesotahave avg pop of of 120543.75
Countries in state Mississippihave avg pop of of 71501.1325301
Countries in state Missourihave avg pop of of 103257.362069
Countries in state Montanahave avg pop of of 34716.3157895
Countries in state Nebraskahave avg pop of of 38858.3191489
Countries in state Nevadahave avg pop of of 300061.222222
Countries in state New Hampshirehave avg pop of of 239358.181818
Countries in state New Jerseyhave avg pop of of 799263.090909
Countries in state New Mexicohave avg pop of of 121128.176471
Countries in state New Yorkhave avg pop of of 615177.84127
Countries in state North Carolinahave avg pop of of 188821.445545
Countries in state North Dakotahave avg pop of of 24910.7777778
Countries in state Ohiohave avg pop of of 259247.280899
Countries in state Oklahomahave avg pop of of 96188.4871795
Countries in state Oregonhave avg pop of of 207085.081081
Countries in state Pennsylvaniahave avg pop of of 373599.382353
Countries in state Rhode Islandhave avg pop of of 350855.666667
Countries in state South Carolinahave avg pop of of 196824.0
Countries in state South Dakotahave avg pop of of 24303.880597
Countries in state Tennesseehave avg pop of of 132210.520833
Countries in state Texashave avg pop of of 197220.086275
Countries in state Utahhave avg pop of of 184259.0
Countries in state Vermonthave avg pop of of 83432.1333333
Countries in state Virginiahave avg pop of of 119371.835821
Countries in state Washingtonhave avg pop of of 336227.0
Countries in state West Virginiahave avg pop of of 66178.3571429
Countries in state Wisconsinhave avg pop of of 155807.835616
Countries in state Wyominghave avg pop of of 46968.8333333

# Scales

In [26]:
s = pd.Series(['Low','High','Medium','High','Low','Low','Medium'])

In [27]:
s.astype('category', categories=['Low','Medium','High'], ordered=True)

0       Low
1      High
2    Medium
3      High
4       Low
5       Low
6    Medium
dtype: category
Categories (3, object): [Low < Medium < High]

# Data Functionality

### Timestamps

In [28]:
pd.Timestamp('10/5/2019 5:46PM')

Timestamp('2019-10-05 17:46:00')

### Period

In [29]:
pd.Period('2019')

Period('2019', 'A-DEC')

In [30]:
pd.Period('2019/05')

Period('2019-05', 'M')

In [31]:
pd.Period('2019/5/10')

Period('2019-05-10', 'D')

In [32]:
t1 = pd.Series(list('xyz'),[pd.Timestamp('2019/05/01'),pd.Timestamp('2019/05/02'),pd.Timestamp('2019/05/03')])

In [33]:
t1

2019-05-01    x
2019-05-02    y
2019-05-03    z
dtype: object

### Timedeltas

In [34]:
pd.Timestamp('2019/05/01') - pd.Timestamp('2018/05/01')

Timedelta('365 days 00:00:00')

In [35]:
pd.Timestamp('2019/05/01')-pd.Timestamp('2018/04/25')

Timedelta('371 days 00:00:00')